
//----------------------------------------------------------------------------
// @author zhangwei on 2006-07-25
// 本程序只测试cc2420 driver， 它会把每一个收到的字符返回去
// 发送方可以在程序中判断接受和发送是否一致。以确定driver是否正常工作。
//
//----------------------------------------------------------------------------

#ifndef _WLSECHO_H_
#define _WLSECHO_H_
//----------------------------------------------------------------------------

#include "..\foundation.h"
#include "..\global.h"

void wls_test( void );

//----------------------------------------------------------------------------
#endif