
//----------------------------------------------------------------------------
// @author zhangwei on 2006-07-25
// 本程序测试cc2420, wireless，siocomm, UART几部分，但只测试一条数据回路
// 它会把cc2420收到的每一个数据包通过UART送给计算机
//
//----------------------------------------------------------------------------

#ifndef _WLSECHO_H_
#define _WLSECHO_H_
//----------------------------------------------------------------------------

#include "..\foundation.h"
#include "..\global.h"

void sniffer_run( void );

//----------------------------------------------------------------------------
#endif
